

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьДанныеОрганизации();
	Если  Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ТрудовойДоговор")  Тогда
		
		Элементы.ТрудовойДоговор.Видимость = Истина;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаУвольнение") Тогда
		Элементы.ЗаявлениеНаУвольнение.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаОтпуск") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаПеревод") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Истина;
	Иначе   
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
	КонецЕсли;
	Объект.ДатаЗ =Объект.Дата;
	Объект.ДатаЗ = Лев(Объект.ДатаЗ,10);
КонецПроцедуры
&НаСервере
Процедура ПолучитьДанныеОрганизации()
	
	Объект.НаименованиеОрганизации = Константы.НаименованиеОрганизации.Получить();
	Объект.ЮридическийАдресОрганизации = Константы.ЮридическийАдресОрганизации.Получить();
	Объект.ИНН = Константы.ИННОрганизации.Получить();
		Объект.Директор = Константы.Директор.Получить();
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Объект.Должность = ДолжностьСотрудника(Объект.Сотрудник);
	Объект.Оклад = ОкладСотрудника(Объект.Сотрудник); 
	Объект.ДатаПриема = ДатаПриемаСотрудника(Объект.Сотрудник);
	Объект.Серия = СерияПаспортаСотрудника(Объект.Сотрудник);
	Объект.НомерПаспорт = НомерПаспортаСотрудника(Объект.Сотрудник); 
	Объект.КемВыдан = КемВыданПаспортСотрудника(Объект.Сотрудник);
	Объект.ДатаВыдачи = ДатаВыдачиПаспортаСотрудника(Объект.Сотрудник);
	Объект.АдресРегистрации = АдресПоПрописке(Объект.Сотрудник);
	Объект.КодПодразделения = КодПодразделения(Объект.Сотрудник);
КонецПроцедуры

Функция ДолжностьСотрудника(Сотрудники)
	
	Возврат Сотрудники.Должность;
	
КонецФункции

Функция ОкладСотрудника(Сотрудники)
	
	Возврат Сотрудники.Оклад;
	
КонецФункции 



Функция ДатаПриемаСотрудника(Сотрудники)
	
	Возврат Сотрудники.ДатаПриёма;
	
КонецФункции    

Функция СерияПаспортаСотрудника(Сотрудники)
	
	Возврат Сотрудники.Серия;
	
КонецФункции      
Функция НомерПаспортаСотрудника(Сотрудники)
	
	Возврат Сотрудники.Номер;
	
КонецФункции   

Функция КемВыданПаспортСотрудника(Сотрудники)
	
	Возврат Сотрудники.КемВыдан;
	
КонецФункции   

Функция ДатаВыдачиПаспортаСотрудника(Сотрудники)
	
	Возврат Сотрудники.ДатаВыдачи;
	
КонецФункции
Функция АдресПоПрописке(Сотрудники)
	
	Возврат Сотрудники.АдресПоПрописке;
	
КонецФункции
Функция КодПодразделения(Сотрудники)
	
	Возврат Сотрудники.КодПодразделения;
	
КонецФункции 

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	Если  Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ТрудовойДоговор")  Тогда
		
		Элементы.ТрудовойДоговор.Видимость = Истина;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаУвольнение") Тогда
		Элементы.ЗаявлениеНаУвольнение.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаОтпуск") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Истина;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;

	ИначеЕсли Объект.ТипДокумента = ПредопределенноеЗначение("Перечисление.ТипДокументаДляЗаявленийСотрудников.ЗаявлениеНаПеревод") Тогда
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь; 
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Истина;
	Иначе   
		Элементы.ЗаявлениеНаПереводНаДругуюДолжность.Видимость = Ложь;
		Элементы.ТрудовойДоговор.Видимость = Ложь;
		Элементы.ЗаявлениеНаУвольнение.Видимость = Ложь;
		Элементы.ЗаявлениеНаОтпуск.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	Объект.ДатаНачалаПодсчет= Объект.ДатаНачала;
	Объект.ДатаОкончанияПодсчет = Объект.ДатаОкончания;
	Объект.КоличествоДней = (НачалоДня(Объект.ДатаОкончания) - НачалоДня(Объект.ДатаНачала))/(60*60*24);
	
КонецПроцедуры

         

	 