
&НаКлиенте
Процедура Сформировать(Команда)
	Серверная();
КонецПроцедуры


&НаСервере
Процедура Серверная()
	
	Макет1=РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет1");
	//получить объект из макета.
	MSWord = Макет1.Получить();
	
	ДатаЗалоговоБилета = формат(ТекущаяДата(), "ДЛФ=D");
	Попытка
		Документ = MSWord.Application.Documents(1);
		Документ.Activate();
		//Получить объект,который будем использовать для поиска и замены.
		Замена = Документ.Content.Find;
		//Заменить заранее определенные ключевые конструкции на требуемый текст.
		Замена.Execute("<Data>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + Дата + "");
		Замена = Документ.Content.Find;
		Замена = Документ.Content.Find;
		Замена.Execute("<NomerMarhruta>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + НомерМаршрута + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<NomerAvtobusa>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + НомерАвтобуса + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<NomerSredstva>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + НомерТранспортногоСредства + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Voditel>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + Водитель + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Nomer>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + Номер + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Konductor>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + Кондуктор + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<NazvanieAvtobusa>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + НазваниеАвтобуса + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<VremiNa>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ВремяНачалаМаршрута + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<VremiKo>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + ВремяКонцаМаршрута + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Mehanic>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + Механик + "");
		Замена = Документ.Content.Find;
		Замена.Execute("<Marshrut>", Ложь, Истина, Ложь, , , Истина, , Ложь, "" + МаршрутТранспорта + "");
		Замена = Документ.Content.Find;

		
	MSWord.Application.Visible = Истина;
	MSWord.Activate();
Исключение
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ОписаниеОшибки();
	Сообщение.Сообщить();
	MSWord.Application.Quit();
КонецПопытки;	

КонецПроцедуры 