
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИзмеренияПланировщика   = Планировщик.Измерения;
    ИзмеренияПланировщика.Очистить();
	
	ЭлементыПланировщика = Планировщик.Элементы;
    ЭлементыПланировщика.Очистить();
	
	Измерениеводит       = ИзмеренияПланировщика.Добавить("Транспорт");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Транспорт.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Транспорт КАК Транспорт";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйТранспорт = Измерениеводит.Элементы.Добавить(ВыборкаДетальныеЗаписи.Наименование);
		НовыйТранспорт.Текст = ВыборкаДетальныеЗаписи.Наименование;
	КонецЦикла;  
	    Измерениеводит       = ИзмеренияПланировщика.Добавить("Водитель");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	      "ВЫБРАТЬ
	      |	Рейс.Транспорт КАК Транспорт,
	      |	Рейс.Водитель КАК Водитель,
	      |	Рейс.Дата КАК Дата
	      |ИЗ
	      |	Документ.Рейс КАК Рейс
	      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	      |		ПО Рейс.Водитель = Сотрудники.Ссылка
	      |			И Рейс.Кондуктор = Сотрудники.Ссылка" ;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеЗначений = Новый Соответствие;
        СоответствиеЗначений.Вставить("Водитель",Строка(ВыборкаДетальныеЗаписи.Водитель));

		Начало  = ВыборкаДетальныеЗаписи.Дата;
        Конец   = ВыборкаДетальныеЗаписи.Дата;

        // Добавление новой записи в промежуток времени
        НовыйЭлемент = ЭлементыПланировщика.Добавить(Начало, Конец);
        НовыйЭлемент.ЗначенияИзмерений  = Новый ФиксированноеСоответствие(СоответствиеЗначений);
        НовыйЭлемент.Текст              = Строка(ВыборкаДетальныеЗаписи.Водитель);
	КонецЦикла;
	
КонецПроцедуры
