
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаявлениеНаОтпуск)
	ТабДок = Новый ТабличныйДокумент;
	ЗаявлениеНаОтпуск(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ЗаявлениеНаОтпуск(ТабДок, ПараметрКоманды)
	Документы.ПриемНаРаботу.ЗаявлениеНаОтпуск(ТабДок, ПараметрКоманды);
КонецПроцедуры
