
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Расписание 
	Движения.Расписание.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		Движение = Движения.Расписание.Добавить();
		Движение.Период = Дата;
		Движение.Водитель = ТекСтрокаРасписание.Водитель;
		Движение.Кондуктор = ТекСтрокаРасписание.Кондуктор;
		Движение.Автобус = ТекСтрокаРасписание.Автобус;
		Движение.НомерМаршрута = ТекСтрокаРасписание.НомерМаршрута;
		Движение.ВремяВыезда = ТекСтрокаРасписание.ВремяВыезда;
	КонецЦикла;

	// регистр ЗанятостьСотрудников
	Движения.ЗанятостьСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаРасписание Из Расписание Цикл
		Движение = Движения.ЗанятостьСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаРасписание.Водитель;
		Движение.Занятость = ТекСтрокаРасписание.Занятость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
