
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриемНаРаботу.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботу.АдресРегистрации,
	|	ПриемНаРаботу.Дата,
	|	ПриемНаРаботу.ДатаВыдачи,
	|	ПриемНаРаботу.ДатаПриема,
	|	ПриемНаРаботу.Директор,
	|	ПриемНаРаботу.Должность,
	|	ПриемНаРаботу.ИНН,
	|	ПриемНаРаботу.КемВыдан,
	|	ПриемНаРаботу.КодПодразделения,
	|	ПриемНаРаботу.КПП,
	|	ПриемНаРаботу.НаименованиеОрганизации,
	|	ПриемНаРаботу.Номер,
	|	ПриемНаРаботу.НомерПаспорт,
	|	ПриемНаРаботу.Оклад,
	|	ПриемНаРаботу.Серия,
	|	ПриемНаРаботу.Сотрудник,
	|	ПриемНаРаботу.ЮридическийАдресОрганизации
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;


		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ЗаявлениеНаУвольнение(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаявлениеНаУвольнение)
	Макет = Документы.ПриемНаРаботу.ПолучитьМакет("ЗаявлениеНаУвольнение");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботу.Дата,
	|	ПриемНаРаботу.ДатаЗ,
	|	ПриемНаРаботу.ДатаУвольнения,
	|	ПриемНаРаботу.Директор,
	|	ПриемНаРаботу.Должность,
	|	ПриемНаРаботу.НаименованиеОрганизации,
	|	ПриемНаРаботу.Номер,
	|	ПриемНаРаботу.Сотрудник
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ЗаявлениеНаОтпуск(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаявлениеНаОтпуск)
	Макет = Документы.ПриемНаРаботу.ПолучитьМакет("ЗаявлениеНаОтпуск");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботу.ДатаЗ КАК ДатаЗ,
	|	ПриемНаРаботу.ДатаНачалаПодсчет КАК ДатаНачалаПодсчет,
	|	ПриемНаРаботу.ДатаОкончанияПодсчет КАК ДатаОкончанияПодсчет,
	|	ПриемНаРаботу.Директор КАК Директор,
	|	ПриемНаРаботу.КоличествоДней КАК КоличествоДней,
	|	ПриемНаРаботу.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	ПриемНаРаботу.Сотрудник КАК Сотрудник,
	|	ПриемНаРаботу.Должность КАК Должность
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();


	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

	
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ЗаявлениеОПереводеНаДругуюДолжность(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаявлениеОПереводеНаДругуюДолжность)
	Макет = Документы.ПриемНаРаботу.ПолучитьМакет("ЗаявлениеОПереводеНаДругуюДолжность");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемНаРаботу.ДатаЗ,
	|	ПриемНаРаботу.ДатаУвольнения,
	|	ПриемНаРаботу.Директор,
	|	ПриемНаРаботу.Должность,
	|	ПриемНаРаботу.ДолжностьДляПеревода,
	|	ПриемНаРаботу.НаименованиеОрганизации,
	|	ПриемНаРаботу.Сотрудник
	|ИЗ
	|	Документ.ПриемНаРаботу КАК ПриемНаРаботу
	|ГДЕ
	|	ПриемНаРаботу.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
