
&НаКлиенте
Процедура СписокНоменклатурыСуммаПриИзменении(Элемент)
	СТЧ=Элементы.СписокНоменклатуры.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры      

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	СТЧ=Элементы.СписокНоменклатуры.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	СТЧ=Элементы.СписокНоменклатуры.ТекущиеДанные;
	СТЧ.Сумма = СТЧ.Количество * СТЧ.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПарметрыЗаписи)
	Объект.СтоимостьРемонта=Объект.СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры
&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
СтрокаРасчета = Элементы.СписокНоменклатуры.ТекущиеДанные;
СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Номенклатура);
СписокНоменклатурыЦенаПриИзменении(Элемент);
КонецПроцедуры                 

       &НаСервере
	   функция ПолучитьЦену (НоменклатураДокумента)
			СтруктураОтбора = Новый Структура;   
			СтруктураОтбора.Вставить("Номенклатура", НоменклатураДокумента);
			РезультатОтбора = РегистрыСведений.Цены.Получить(СтруктураОтбора);
          Возврат РезультатОтбора.Цена;
		  КонецФункции

                 